app/controllers/entries_controller.rb

	def index
		respond_with Entry.all
---
SELECT "entries".* FROM "entries"

	def create
		respond_with Entry.create(params[:entry])
---
INSERT INTO "entries" ("created_at", "name", "updated_at", "winner") VALUES (?, ?, ?, ?)  [["created_at", Fri, 31 May 2013 02:59:22 UTC +00:00], ["name", "Joselito"], ["updated_at", Fri, 31 May 2013 02:59:22 UTC +00:00], ["winner", false]]

	def update
		respond_with Entry.update(params[:id], params[:entry])
---
UPDATE "entries" SET "winner" = 't', "updated_at" = '2013-05-31 02:58:25.329138' WHERE "entries"."id" = 4

	def destroy
		respond_with Entry.destroy(params[:id])
---
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 4]]